# Напишите процедуру, которая принимает параметр – натуральное число N –
# и выводит на экран треугольник из * с катетами равными N.
# *
# **
# ***
# ****
# *****
# ******
# *******
# ********
# *********
# **********
n = int(input())
def star(n):
    if n < 0:
        print('Error, n > 0')
    for i in range(1,n+1):
        print('*'*i)
    return ''
print(star(n))