# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII

n = int(input())
a = n//1000
b = (n//500)%2
c = (n//100)%10 - 5*b
d = (n//50)%2
e = (n%100)//10 - 5*d
f = (n//5)%2
g = n%10 - 5*f
if g + 1 % 5:
    g = 0
    f += 1
print('M'*a, 'D'* b, 'C'*c, 'L'*d, 'X'*e, 'V'*f, 'I'*g, sep='')